/* include/acx100.h
 *
 * --------------------------------------------------------------------
 *
 * Copyright (C) 2003  ACX100 Open Source Project
 *
 *   The contents of this file are subject to the Mozilla Public
 *   License Version 1.1 (the "License"); you may not use this file
 *   except in compliance with the License. You may obtain a copy of
 *   the License at http://www.mozilla.org/MPL/
 *
 *   Software distributed under the License is distributed on an "AS
 *   IS" basis, WITHOUT WARRANTY OF ANY KIND, either express or
 *   implied. See the License for the specific language governing
 *   rights and limitations under the License.
 *
 *   Alternatively, the contents of this file may be used under the
 *   terms of the GNU Public License version 2 (the "GPL"), in which
 *   case the provisions of the GPL are applicable instead of the
 *   above.  If you wish to allow the use of your version of this file
 *   only under the terms of the GPL and not to allow others to use
 *   your version of this file under the MPL, indicate your decision
 *   by deleting the provisions above and replace them with the notice
 *   and other provisions required by the GPL.  If you do not delete
 *   the provisions above, a recipient may use your version of this
 *   file under either the MPL or the GPL.
 *
 * --------------------------------------------------------------------
 *
 * This code is based on elements which are

#define ACX100_INTEN_ISCMD(value)	((UINT16)(((UINT16)(value)) & ACX100_INTEN_CMD))
#define ACX100_INTEN_CMD_SET(value)	((UINT16)(((UINT16)(value)) << 4))
#define ACX100_INTEN_ISALLOC(value)	((UINT16)(((UINT16)(value)) & ACX100_INTEN_ALLOC))
#define ACX100_INTEN_ALLOC_SET(value)	((UINT16)(((UINT16)(value)) << 3))
#define ACX100_INTEN_ISTXEXC(value)	((UINT16)(((UINT16)(value)) & ACX100_INTEN_TXEXC))
#define ACX100_INTEN_TXEXC_SET(value)	((UINT16)(((UINT16)(value)) << 2))
#define ACX100_INTEN_ISTX(value)	((UINT16)(((UINT16)(value)) & ACX100_INTEN_TX))
#define ACX100_INTEN_TX_SET(value)	((UINT16)(((UINT16)(value)) << 1))
#define ACX100_INTEN_ISRX(value)	((UINT16)(((UINT16)(value)) & ACX100_INTEN_RX))
#define ACX100_INTEN_RX_SET(value)	((UINT16)(((UINT16)(value)) << 0))

#define ACX100_EVACK_ISTICK(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_TICK))
#define ACX100_EVACK_TICK_SET(value)	((UINT16)(((UINT16)(value)) << 15))
#define ACX100_EVACK_ISWTERR(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_WTERR))
#define ACX100_EVACK_WTERR_SET(value)	((UINT16)(((UINT16)(value)) << 14))
#define ACX100_EVACK_ISINFDROP(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_INFDROP))
#define ACX100_EVACK_INFDROP_SET(value)	((UINT16)(((UINT16)(value)) << 13))
#define ACX100_EVACK_ISINFO(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_INFO))
#define ACX100_EVACK_INFO_SET(value)	((UINT16)(((UINT16)(value)) << 7))
#define ACX100_EVACK_ISDTIM(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_DTIM))
#define ACX100_EVACK_DTIM_SET(value)	((UINT16)(((UINT16)(value)) << 5))
#define ACX100_EVACK_ISCMD(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_CMD))
#define ACX100_EVACK_CMD_SET(value)	((UINT16)(((UINT16)(value)) << 4))
#define ACX100_EVACK_ISALLOC(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_ALLOC))
#define ACX100_EVACK_ALLOC_SET(value)	((UINT16)(((UINT16)(value)) << 3))
#define ACX100_EVACK_ISTXEXC(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_TXEXC))
#define ACX100_EVACK_TXEXC_SET(value)	((UINT16)(((UINT16)(value)) << 2))
#define ACX100_EVACK_ISTX(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_TX))
#define ACX100_EVACK_TX_SET(value)	((UINT16)(((UINT16)(value)) << 1))
#define ACX100_EVACK_ISRX(value)	((UINT16)(((UINT16)(value)) & ACX100_EVACK_RX))
#define ACX100_EVACK_RX_SET(value)	((UINT16)(((UINT16)(value)) << 0))

#define ACX100_CONTROL_AUXEN_SET(value)	((UINT16)(((UINT16)(value)) << 14))
#define ACX100_CONTROL_AUXEN_GET(value)	((UINT16)(((UINT16)(value)) >> 14))

/*--- Host Maintained State Info ---------------------------------------------*/
#define ACX100_STATE_PREINIT	0
#define ACX100_STATE_INIT	1
#define ACX100_STATE_RUNNING	2

/*============================================================================*
 * Types and their related constants                                          *
 *============================================================================*/

/*--- Commonly used basic types ----------------------------------------------*/
typedef struct acx100_bytestr {
	UINT16 len __WLAN_ATTRIB_PACK__;
	UINT8 data[0] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_bytestr_t;

typedef struct acx100_bytestr32 {
	UINT16 len __WLAN_ATTRIB_PACK__;
	UINT8 data[32] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_bytestr32_t;

/*--- Configuration Record Structures: ---------------------------------------*
 *--- Network Parameters, Static Configuration Entities ----------------------*/

/*-- Prototype structure --*/
/* all configuration record structures start with these members */
typedef struct acx100_mem_t {
	UINT base;
	UINT len;
	long time;
} mem_t;

typedef struct acx100_record {
	UINT16 reclen __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_rec_t;

typedef struct acx100_record16 {
	UINT16 reclen __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT16 val __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_rec16_t;

typedef struct acx100_record32 {
	UINT16 reclen __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT32 val __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_rec32;

/*-- Hardware/Firmware Component Information --*/
typedef struct acx100_compident {
	UINT16 id __WLAN_ATTRIB_PACK__;
	UINT16 variant __WLAN_ATTRIB_PACK__;
	UINT16 major __WLAN_ATTRIB_PACK__;
	UINT16 minor __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_compident_t;

typedef struct acx100_caplevel {
	UINT16 role __WLAN_ATTRIB_PACK__;
	UINT16 id __WLAN_ATTRIB_PACK__;
	UINT16 variant __WLAN_ATTRIB_PACK__;
	UINT16 bottom __WLAN_ATTRIB_PACK__;
	UINT16 top __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_caplevel_t;

/*--- Communication Frames: Receive Frame Structure --------------------------*/
typedef struct acx100_rx_frame {
	/*-- MAC RX descriptor (acx100 byte order) --*/
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT32 time __WLAN_ATTRIB_PACK__;
	UINT8 silence __WLAN_ATTRIB_PACK__;
	UINT8 signal __WLAN_ATTRIB_PACK__;
	UINT8 rate __WLAN_ATTRIB_PACK__;
	UINT8 rx_flow __WLAN_ATTRIB_PACK__;
	UINT16 reserved1 __WLAN_ATTRIB_PACK__;
	UINT16 reserved2 __WLAN_ATTRIB_PACK__;

	/*-- 802.11 Header Information (802.11 byte order) --*/
	UINT16 frame_control __WLAN_ATTRIB_PACK__;
	UINT16 duration_id __WLAN_ATTRIB_PACK__;
	UINT8 address1[6] __WLAN_ATTRIB_PACK__;
	UINT8 address2[6] __WLAN_ATTRIB_PACK__;
	UINT8 address3[6] __WLAN_ATTRIB_PACK__;
	UINT16 sequence_control __WLAN_ATTRIB_PACK__;
	UINT8 address4[6] __WLAN_ATTRIB_PACK__;
	UINT16 data_len __WLAN_ATTRIB_PACK__;	/* acx100 (little endian) format */

	/*-- 802.3 Header Information --*/
	UINT8 dest_addr[6] __WLAN_ATTRIB_PACK__;
	UINT8 src_addr[6] __WLAN_ATTRIB_PACK__;
	UINT16 data_length __WLAN_ATTRIB_PACK__;	/* IEEE? (big endian) format */
} __WLAN_ATTRIB_PACK__ acx100_rx_frame_t;

/*--- Communication Frames: Field Masks for Receive Frames -------------------*/
/*-- Offsets --*/
#define ACX100_RX_DATA_LEN_OFF		((UINT16)44)
#define ACX100_RX_80211HDR_OFF		((UINT16)14)
#define ACX100_RX_DATA_OFF		((UINT16)60)

/*-- Status Fields --*/
#define ACX100_RXSTATUS_MSGTYPE		((UINT16)(BIT15 | BIT14 | BIT13))
#define ACX100_RXSTATUS_MACPORT		((UINT16)(BIT10 | BIT9 | BIT8))
#define ACX100_RXSTATUS_UNDECR		((UINT16)BIT1)
#define ACX100_RXSTATUS_FCSERR		((UINT16)BIT0)

/*--- Communication Frames: Test/Get/Set Field Values for Receive Frames -----*/
#define ACX100_RXSTATUS_MSGTYPE_GET(value) \
		((UINT16)((((UINT16)(value)) & ACX100_RXSTATUS_MSGTYPE) >> 13))
#define ACX100_RXSTATUS_MSGTYPE_SET(value) \
		((UINT16)(((UINT16)(value)) << 13))
#define ACX100_RXSTATUS_MACPORT_GET(value) \
		((UINT16)((((UINT16)(value)) & ACX100_RXSTATUS_MACPORT) >> 8))
#define ACX100_RXSTATUS_MACPORT_SET(value) \
		((UINT16)(((UINT16)(value)) << 8))
#define ACX100_RXSTATUS_ISUNDECR(value)	 \
		((UINT16)(((UINT16)(value)) & ACX100_RXSTATUS_UNDECR))
#define ACX100_RXSTATUS_ISFCSERR(value)	 \
		((UINT16)(((UINT16)(value)) & ACX100_RXSTATUS_FCSERR))

/*============================================================================*
 * Information Frames Structures                                              *
 *============================================================================*/

/*--- Information Types ------------------------------------------------------*/
#define ACX100_IT_HANDOVERADDR		((UINT16)0xF000UL)
#define ACX100_IT_COMMTALLIES		((UINT16)0xF100UL)
#define ACX100_IT_SCANRESULTS		((UINT16)0xF101UL)
#define ACX100_IT_CHINFORESULTS		((UINT16)0xF102UL)
#define ACX100_IT_HOSTSCANRESULTS	((UINT16)0xF103UL)	/* NEW */
#define ACX100_IT_LINKSTATUS		((UINT16)0xF200UL)
#define ACX100_IT_ASSOCSTATUS		((UINT16)0xF201UL)
#define ACX100_IT_AUTHREQ		((UINT16)0xF202UL)
#define ACX100_IT_PSUSERCNT		((UINT16)0xF203UL)
#define ACX100_IT_KEYIDCHANGED		((UINT16)0xF204UL)	/* NEW AP */

/*-- Notification Frame, MAC Mgmt: Handover Address --*/
typedef struct acx100_HandoverAddr {
	UINT16 framelen __WLAN_ATTRIB_PACK__;
	UINT16 infotype __WLAN_ATTRIB_PACK__;
	UINT8 handover_addr[WLAN_BSSID_LEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_HandoverAddr_t;

/*-- Inquiry Frame, Diagnose: Communication Tallies --*/
typedef struct __WLAN_ATTRIB_PACK__ acx100_CommTallies16 {
	UINT16 txunicastframes __WLAN_ATTRIB_PACK__;
	UINT16 txmulticastframes __WLAN_ATTRIB_PACK__;
	UINT16 txfragments __WLAN_ATTRIB_PACK__;
	UINT16 txunicastoctets __WLAN_ATTRIB_PACK__;
	UINT16 txmulticastoctets __WLAN_ATTRIB_PACK__;
	UINT16 txdeferredtrans __WLAN_ATTRIB_PACK__;
	UINT16 txsingleretryframes __WLAN_ATTRIB_PACK__;
	UINT16 txmultipleretryframes __WLAN_ATTRIB_PACK__;
	UINT16 txretrylimitexceeded __WLAN_ATTRIB_PACK__;
	UINT16 txdiscards __WLAN_ATTRIB_PACK__;
	UINT16 rxunicastframes __WLAN_ATTRIB_PACK__;
	UINT16 rxmulticastframes __WLAN_ATTRIB_PACK__;
	UINT16 rxfragments __WLAN_ATTRIB_PACK__;
	UINT16 rxunicastoctets __WLAN_ATTRIB_PACK__;
	UINT16 rxmulticastoctets __WLAN_ATTRIB_PACK__;
	UINT16 rxfcserrors __WLAN_ATTRIB_PACK__;
	UINT16 rxdiscardsnobuffer __WLAN_ATTRIB_PACK__;
	UINT16 txdiscardswrongsa __WLAN_ATTRIB_PACK__;
	UINT16 rxdiscardswepundecr __WLAN_ATTRIB_PACK__;
	UINT16 rxmsginmsgfrag __WLAN_ATTRIB_PACK__;
	UINT16 rxmsginbadmsgfrag __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_CommTallies16_t;

typedef struct __WLAN_ATTRIB_PACK__ acx100_CommTallies32 {
	UINT32 txunicastframes __WLAN_ATTRIB_PACK__;
	UINT32 txmulticastframes __WLAN_ATTRIB_PACK__;
	UINT32 txfragments __WLAN_ATTRIB_PACK__;
	UINT32 txunicastoctets __WLAN_ATTRIB_PACK__;
	UINT32 txmulticastoctets __WLAN_ATTRIB_PACK__;
	UINT32 txdeferredtrans __WLAN_ATTRIB_PACK__;
	UINT32 txsingleretryframes __WLAN_ATTRIB_PACK__;
	UINT32 txmultipleretryframes __WLAN_ATTRIB_PACK__;
	UINT32 txretrylimitexceeded __WLAN_ATTRIB_PACK__;
	UINT32 txdiscards __WLAN_ATTRIB_PACK__;
	UINT32 rxunicastframes __WLAN_ATTRIB_PACK__;
	UINT32 rxmulticastframes __WLAN_ATTRIB_PACK__;
	UINT32 rxfragments __WLAN_ATTRIB_PACK__;
	UINT32 rxunicastoctets __WLAN_ATTRIB_PACK__;
	UINT32 rxmulticastoctets __WLAN_ATTRIB_PACK__;
	UINT32 rxfcserrors __WLAN_ATTRIB_PACK__;
	UINT32 rxdiscardsnobuffer __WLAN_ATTRIB_PACK__;
	UINT32 txdiscardswrongsa __WLAN_ATTRIB_PACK__;
	UINT32 rxdiscardswepundecr __WLAN_ATTRIB_PACK__;
	UINT32 rxmsginmsgfrag __WLAN_ATTRIB_PACK__;
	UINT32 rxmsginbadmsgfrag __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_CommTallies32_t;

/*-- Inquiry Frame, Diagnose: Scan Results & Subfields --*/
typedef struct acx100_ScanResultSub {
	UINT16 chid __WLAN_ATTRIB_PACK__;
	UINT16 anl __WLAN_ATTRIB_PACK__;
	UINT16 sl __WLAN_ATTRIB_PACK__;
	UINT8 bssid[WLAN_BSSID_LEN] __WLAN_ATTRIB_PACK__;
	UINT16 bcnint __WLAN_ATTRIB_PACK__;
	UINT16 capinfo __WLAN_ATTRIB_PACK__;
	acx100_bytestr32_t ssid __WLAN_ATTRIB_PACK__;
	UINT8 supprates[10] __WLAN_ATTRIB_PACK__;	/* 802.11 info element */
	UINT16 proberesp_rate __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_ScanResultSub_t;

typedef struct acx100_ScanResult {
	UINT16 rsvd __WLAN_ATTRIB_PACK__;
	UINT16 scanreason __WLAN_ATTRIB_PACK__;
	 acx100_ScanResultSub_t
	    result[ACX100_SCANRESULT_MAX] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_ScanResult_t;

/*-- Inquiry Frame, Diagnose: ChInfo Results & Subfields --*/
typedef struct acx100_ChInfoResultSub {
	UINT16 chid __WLAN_ATTRIB_PACK__;
	UINT16 anl __WLAN_ATTRIB_PACK__;
	UINT16 pnl __WLAN_ATTRIB_PACK__;
	UINT16 active __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_ChInfoResultSub_t;

#define ACX100_CHINFORESULT_BSSACTIVE	BIT0
#define ACX100_CHINFORESULT_PCFACTIVE	BIT1

typedef struct acx100_ChInfoResult {
	UINT16 scanchannels __WLAN_ATTRIB_PACK__;
	 acx100_ChInfoResultSub_t
	    result[ACX100_CHINFORESULT_MAX] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_ChInfoResult_t;

/*-- Inquiry Frame, Diagnose: Host Scan Results & Subfields --*/
typedef struct acx100_HScanResultSub {
	UINT16 chid __WLAN_ATTRIB_PACK__;
	UINT16 anl __WLAN_ATTRIB_PACK__;
	UINT16 sl __WLAN_ATTRIB_PACK__;
	UINT8 bssid[WLAN_BSSID_LEN] __WLAN_ATTRIB_PACK__;
	UINT16 bcnint __WLAN_ATTRIB_PACK__;
	UINT16 capinfo __WLAN_ATTRIB_PACK__;
	acx100_bytestr32_t ssid __WLAN_ATTRIB_PACK__;
	UINT8 supprates[10] __WLAN_ATTRIB_PACK__;	/* 802.11 info element */
	UINT16 proberesp_rate __WLAN_ATTRIB_PACK__;
	UINT16 atim __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_HScanResultSub_t;

typedef struct acx100_HScanResult {
	UINT16 nresult __WLAN_ATTRIB_PACK__;
	UINT16 rsvd __WLAN_ATTRIB_PACK__;
	 acx100_HScanResultSub_t
	    result[ACX100_HSCANRESULT_MAX] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_HScanResult_t;

/*-- Unsolicited Frame, MAC Mgmt: LinkStatus --*/
#define ACX100_LINK_NOTCONNECTED	((UINT16)0)
#define ACX100_LINK_CONNECTED		((UINT16)1)
#define ACX100_LINK_DISCONNECTED	((UINT16)2)
#define ACX100_LINK_AP_CHANGE		((UINT16)3)
#define ACX100_LINK_AP_OUTOFRANGE	((UINT16)4)
#define ACX100_LINK_AP_INRANGE		((UINT16)5)
#define ACX100_LINK_ASSOCFAIL		((UINT16)6)

typedef struct acx100_LinkStatus {
	UINT16 linkstatus __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_LinkStatus_t;

/*-- Unsolicited Frame, MAC Mgmt: AssociationStatus --*/
#define ACX100_ASSOCSTATUS_STAASSOC	((UINT16)1)
#define ACX100_ASSOCSTATUS_REASSOC	((UINT16)2)
#define ACX100_ASSOCSTATUS_DISASSOC	((UINT16)3)
#define ACX100_ASSOCSTATUS_ASSOCFAIL	((UINT16)4)
#define ACX100_ASSOCSTATUS_AUTHFAIL	((UINT16)5)

typedef struct acx100_AssocStatus {
	UINT16 assocstatus __WLAN_ATTRIB_PACK__;
	UINT8 sta_addr[WLAN_ADDR_LEN] __WLAN_ATTRIB_PACK__;
	/* old_ap_addr is only valid if assocstatus == 2 */
	UINT8 old_ap_addr[WLAN_ADDR_LEN] __WLAN_ATTRIB_PACK__;
	UINT16 reason __WLAN_ATTRIB_PACK__;
	UINT16 reserved __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_AssocStatus_t;

/*-- Unsolicited Frame, MAC Mgmt: AuthRequest (AP Only) --*/
typedef struct acx100_AuthRequest {
	UINT8 sta_addr[WLAN_ADDR_LEN] __WLAN_ATTRIB_PACK__;
	UINT16 algorithm __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_AuthReq_t;

/*-- Unsolicited Frame, MAC Mgmt: PSUserCount (AP Only) --*/
typedef struct acx100_PSUserCount {
	UINT16 usercnt __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_PSUserCount_t;

/*-- Collection of all Inf frames --*/
typedef union acx100_infodata {
	acx100_CommTallies16_t commtallies16 __WLAN_ATTRIB_PACK__;
	acx100_CommTallies32_t commtallies32 __WLAN_ATTRIB_PACK__;
	acx100_ScanResult_t scanresult __WLAN_ATTRIB_PACK__;
	acx100_ChInfoResult_t chinforesult __WLAN_ATTRIB_PACK__;
	acx100_HScanResult_t hscanresult __WLAN_ATTRIB_PACK__;
	acx100_LinkStatus_t linkstatus __WLAN_ATTRIB_PACK__;
	acx100_AssocStatus_t assocstatus __WLAN_ATTRIB_PACK__;
	acx100_AuthReq_t authreq __WLAN_ATTRIB_PACK__;
	acx100_PSUserCount_t psusercnt __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_infodata_t;

typedef struct acx100_InfFrame {
	UINT16 framelen __WLAN_ATTRIB_PACK__;
	UINT16 infotype __WLAN_ATTRIB_PACK__;
	acx100_infodata_t info __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_InfFrame_t;

/* Descriptor Control Bits */

#define ACX100_CTL_PREAMBLE   0x01	/* Preable type: 0 = long; 1 = short */
#define ACX100_CTL_FIRSTFRAG  0x02	/* This is the 1st frag of the frame */
#define ACX100_CTL_AUTODMA    0x04
#define ACX100_CTL_RECLAIM    0x08	/* ready to reuse */
#define ACX100_CTL_HOSTDONE   0x20	/* host has finished processing */
#define ACX100_CTL_ACXDONE    0x40	/* acx100 has finished processing */
#define ACX100_CTL_OWN        0x80	/* host owns the desc */


#define ACX_TXRATE_1		10
#define ACX_TXRATE_2		20
#define ACX_TXRATE_5_5		55
#define ACX_TXRATE_5_5PBCC	183
#define ACX_TXRATE_11		110
#define ACX_TXRATE_11PBCC	238
#define ACX_TXRATE_22PBCC	220




#if (WLAN_HOSTIF == WLAN_USB)

/*============================================================================*
 * USB Packet structures and constants                                        *
 *============================================================================*/

/* Should be sent to the ctrlout endpoint */
#define ACX100_USB_ENBULKIN	6

/* Should be sent to the bulkout endpoint */
#define ACX100_USB_TXFRM	0
#define ACX100_USB_CMDREQ	1
#define ACX100_USB_WRIDREQ	2
#define ACX100_USB_RRIDREQ	3
#define ACX100_USB_WMEMREQ	4
#define ACX100_USB_RMEMREQ	5
#define ACX100_USB_UPLOAD_FW 0x10
#define ACX100_USB_ACK_CS 0x11
#define ACX100_USB_UNKNOWN_REQ1 0x12
#define ACX100_USB_TX_DESC 0xA

/* Received from the bulkin endpoint */
#define ACX100_USB_ISFRM(a)	((a) < 0x7fff)
#define ACX100_USB_ISTXFRM(a)	(ACX100_USB_ISFRM((a)) && ((a) & 0x1000))
#define ACX100_USB_ISRXFRM(a)	(ACX100_USB_ISFRM((a)) && !((a) & 0x1000))
#define ACX100_USB_INFOFRM	0x8000
#define ACX100_USB_CMDRESP	0x8001
#define ACX100_USB_WRIDRESP	0x8002
#define ACX100_USB_RRIDRESP	0x8003
#define ACX100_USB_WMEMRESP	0x8004
#define ACX100_USB_RMEMRESP	0x8005
#define ACX100_USB_BUFAVAIL	0x8006
#define ACX100_USB_ERROR	0x8007

#define ACX100_USB_TXHI_ISDATA     0x1
#define ACX100_USB_TXHI_DIRECTED   0x2
#define ACX100_USB_TXHI_BROADCAST  0x4

#define ACX100_USB_CTL2_FCS       0x02
#define ACX100_USB_CTL2_MORE_FRAG 0x04
#define ACX100_USB_CTL2_RTS       0x20


/*--- Request (bulk OUT) packet contents -------------------------------------*/

typedef struct acx100_usb_txhdr {
  UINT16	desc __WLAN_ATTRIB_PACK__;
  UINT16 MPDUlen __WLAN_ATTRIB_PACK__;
  UINT8 index __WLAN_ATTRIB_PACK__;
  UINT8 txRate __WLAN_ATTRIB_PACK__;
  UINT32 hostData __WLAN_ATTRIB_PACK__;
  UINT8  ctrl1 __WLAN_ATTRIB_PACK__;
  UINT8  ctrl2 __WLAN_ATTRIB_PACK__;
  UINT16 dataLength __WLAN_ATTRIB_PACK__;
} acx100_usb_txhdr_t;


typedef struct acx100_usb_txfrm {
  acx100_usb_txhdr_t hdr;
  UINT8 data[WLAN_DATA_MAXLEN];
} acx100_usb_txfrm_t __WLAN_ATTRIB_PACK__;

typedef struct acx100_usb_scan {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 pad0 __WLAN_ATTRIB_PACK__;
	UINT16 unk1 __WLAN_ATTRIB_PACK__;
	UINT16 unk2 __WLAN_ATTRIB_PACK__;
} acx100_usb_scan_t __WLAN_ATTRIB_PACK__;

typedef struct acx100_usb_scan_status {
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT16 length __WLAN_ATTRIB_PACK__;
	UINT32	status __WLAN_ATTRIB_PACK__;
} acx100_usb_scan_status_t __WLAN_ATTRIB_PACK__;

typedef struct acx100_usb_cmdreq {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 parm0 __WLAN_ATTRIB_PACK__;
	UINT16 parm1 __WLAN_ATTRIB_PACK__;
	UINT16 parm2 __WLAN_ATTRIB_PACK__;
	UINT8 pad[54] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_cmdreq_t;

typedef struct acx100_usb_wridreq {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status  __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT16 frmlen __WLAN_ATTRIB_PACK__;
	UINT8 data[ACX100_RIDDATA_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_wridreq_t;

typedef struct acx100_usb_rridreq {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT16 frmlen __WLAN_ATTRIB_PACK__;
	UINT8 pad[56] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rridreq_t;

typedef struct acx100_usb_wmemreq {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	/*
  UINT16 offset __WLAN_ATTRIB_PACK__;
	UINT16 page __WLAN_ATTRIB_PACK__;
  */
	UINT8 data[ACX100_USB_RWMEM_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_wmemreq_t;

typedef struct acx100_usb_rxtx_ctrl {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT8 data __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rxtx_ctrl_t;

typedef struct acx100_usb_rmemreq {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT8 data[ACX100_USB_RWMEM_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rmemreq_t;

/*--- Response (bulk IN) packet contents -------------------------------------*/

typedef struct acx100_usb_rxfrm {
	acx100_rx_frame_t desc __WLAN_ATTRIB_PACK__;
	UINT8 data[WLAN_DATA_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rxfrm_t;

typedef struct acx100_usb_infofrm {
	UINT16 type __WLAN_ATTRIB_PACK__;
	acx100_InfFrame_t info __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_infofrm_t;

typedef struct acx100_usb_cmdresp {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT16 resp0 __WLAN_ATTRIB_PACK__;
	UINT16 resp1 __WLAN_ATTRIB_PACK__;
	UINT16 resp2 __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_cmdresp_t;

typedef struct acx100_usb_wridresp {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT16 resp0 __WLAN_ATTRIB_PACK__;
	UINT16 resp1 __WLAN_ATTRIB_PACK__;
	UINT16 resp2 __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_wridresp_t;

typedef struct acx100_usb_rridresp {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT16 rid __WLAN_ATTRIB_PACK__;
	UINT16 frmlen __WLAN_ATTRIB_PACK__;
	UINT8 data[ACX100_RIDDATA_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rridresp_t;

typedef struct acx100_usb_wmemresp {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT16 resp0 __WLAN_ATTRIB_PACK__;
	UINT16 resp1 __WLAN_ATTRIB_PACK__;
	UINT16 resp2 __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_wmemresp_t;

typedef struct acx100_usb_rmemresp {
	UINT16 cmd __WLAN_ATTRIB_PACK__;
	UINT16 status __WLAN_ATTRIB_PACK__;
	UINT8 data[ACX100_USB_RWMEM_MAXLEN] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_rmemresp_t;

typedef struct acx100_usb_bufavail {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 frmlen __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_bufavail_t;

typedef struct acx100_usb_error {
	UINT16 type __WLAN_ATTRIB_PACK__;
	UINT16 errortype __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usb_error_t;

/*--- Unions for packaging all the known packet types together ---------------*/

typedef union acx100_usbout {
  UINT16 type __WLAN_ATTRIB_PACK__;
	acx100_usb_txfrm_t txfrm __WLAN_ATTRIB_PACK__;
	acx100_usb_cmdreq_t cmdreq __WLAN_ATTRIB_PACK__;
	acx100_usb_wridreq_t wridreq __WLAN_ATTRIB_PACK__;
	acx100_usb_rridreq_t rridreq __WLAN_ATTRIB_PACK__;
	acx100_usb_wmemreq_t wmemreq __WLAN_ATTRIB_PACK__;
	acx100_usb_rmemreq_t rmemreq __WLAN_ATTRIB_PACK__;
	acx100_usb_rxtx_ctrl_t rxtx __WLAN_ATTRIB_PACK__;
	acx100_usb_scan_t scan __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usbout_t;

typedef union acx100_usbin {
	UINT16 type __WLAN_ATTRIB_PACK__;
	acx100_usb_rxfrm_t rxfrm __WLAN_ATTRIB_PACK__;
	acx100_usb_txfrm_t txfrm __WLAN_ATTRIB_PACK__;
	acx100_usb_infofrm_t infofrm __WLAN_ATTRIB_PACK__;
	acx100_usb_cmdresp_t cmdresp __WLAN_ATTRIB_PACK__;
	acx100_usb_wridresp_t wridresp __WLAN_ATTRIB_PACK__;
	acx100_usb_rridresp_t rridresp __WLAN_ATTRIB_PACK__;
	acx100_usb_wmemresp_t wmemresp __WLAN_ATTRIB_PACK__;
	acx100_usb_rmemresp_t rmemresp __WLAN_ATTRIB_PACK__;
	acx100_usb_bufavail_t bufavail __WLAN_ATTRIB_PACK__;
	acx100_usb_error_t usberror __WLAN_ATTRIB_PACK__;
	UINT8 boguspad[3000] __WLAN_ATTRIB_PACK__;
} __WLAN_ATTRIB_PACK__ acx100_usbin_t;

#endif /* WLAN_HOSTIF == WLAN_USB */

/*--- Firmware statistics ----------------------------------------------------*/
typedef struct fw_stats {
	UINT val0x0;		/* hdr; */
	UINT tx_desc_of;
	UINT rx_oom;
	UINT rx_hdr_of;
	UINT rx_hdr_use_next;
	UINT rx_dropped_frame;
	UINT rx_frame_ptr_err;
	UINT rx_xfr_hint_trig;

	UINT rx_dma_req;	/* val0x1c */
	UINT rx_dma_err;	/* val0x20 */
	UINT tx_dma_req;
	UINT tx_dma_err;	/* val0x28 */

	UINT cmd_cplt;
	UINT fiq;
	UINT rx_hdrs;		/* val0x34 */
	UINT rx_cmplt;		/* val0x38 */
	UINT rx_mem_of;		/* val0x3c */
	UINT rx_rdys;
	UINT irqs;
	UINT acx_trans_procs;
	UINT decrypt_done;	/* val0x48 */
	UINT dma_0_done;
	UINT dma_1_done;
	UINT tx_exch_complet;
	UINT commands;
	UINT acx_rx_procs;
	UINT hw_pm_mode_changes;
	UINT host_acks;
	UINT pci_pm;
	UINT acm_wakeups;

	UINT wep_key_count;
	UINT wep_default_key_count;
	UINT dot11_def_key_mib;
	UINT wep_key_not_found;
	UINT wep_decrypt_fail;
} fw_stats_t;

/* Firmware version struct */

typedef struct fw_ver {
	UINT16 vala;
	UINT16 valb;
	char fw_id[20];
	UINT32 hw_id;
} fw_ver_t;

/*--- IEEE 802.11 header -----------------------------------------------------*/
/* FIXME: acx100_addr3_t should probably actually be discarded in favour of the
 * identical linux-wlan-ng p80211_hdr_t. An even better choice would be to use
 * the kernel's struct ieee80_11_hdr from driver/net/wireless/ieee802_11.h */
typedef struct acx100_addr3 {
	/* IEEE 802.11-1999.pdf chapter 7 might help */
	UINT16 frame_control __WLAN_ATTRIB_PACK__;	/* 0x00, wlan-ng name */
	UINT16 duration_id __WLAN_ATTRIB_PACK__;	/* 0x02, wlan-ng name */
	char address1[0x6] __WLAN_ATTRIB_PACK__;	/* 0x04, wlan-ng name */
	char address2[0x6] __WLAN_ATTRIB_PACK__;	/* 0x0a */
	char address3[0x6] __WLAN_ATTRIB_PACK__;	/* 0x10 */
	UINT16 sequence_control __WLAN_ATTRIB_PACK__;	/* 0x16 */
	UINT8 *val0x18;
	struct sk_buff *val0x1c;
	struct sk_buff *val0x20;
} acx100_addr3_t;

/*--- WEP stuff --------------------------------------------------------------*/
#define NUM_WEPKEYS			4
#define MAX_KEYLEN			32

#define HOSTWEP_DEFAULTKEY_MASK		(BIT1 | BIT0)
#define HOSTWEP_DECRYPT			BIT4
#define HOSTWEP_ENCRYPT			BIT5
#define HOSTWEP_PRIVACYINVOKED		BIT6
#define HOSTWEP_EXCLUDEUNENCRYPTED	BIT7

typedef struct wep_key {
	UINT8 index;
	size_t size;
	UINT8 key[29];
	UINT16 strange_filler;
} wep_key_t;			/* size = 264 bytes (33*8) */
/* FIXME: We don't have size 264! Or is there 2 bytes beyond the key
 * (strange_filler)? */

typedef struct key_struct {
	UINT8 addr[ETH_ALEN];	/* 0x00 */
	UINT16 filler1;		/* 0x06 */
	UINT32 filler2;		/* 0x08 */
	UINT32 index;		/* 0x0c */
	UINT16 len;		/* 0x10 */
	UINT8 key[29];		/* 0x12; is this long enough??? */
} key_struct_t;			/* size = 276. FIXME: where is the remaining space?? */


typedef struct client {
	UINT16 aid;		/* association ID */
	char address[ETH_ALEN];	/* 0x2 */
	UINT8 val0x8;
	UINT8 used;		/* 0x9 */
	UINT16 val0xa;
	UINT16 auth_alg;
	UINT16 val0xe;
	UINT8 *val0x10;		/* points to some data, don't know what yet */
	UINT32 unkn0x14;
	UINT8 val0x18[0x80];	/* 0x18, used by acx100_process_authen() */
	UINT16 val0x98;
	UINT16 val0x9a;
	UINT8 pad5[8];		/* 0x9c */
	struct client *next;	/* 0xa4 */
} client_t;


/*--- Tx and Rx descriptor ring buffer administration ------------------------*/
typedef struct TIWLAN_DC {	/* V3 version */
	struct	wlandevice 	*priv;
	UINT32		val0x4;			/* spacing */
	UINT32		ui32ACXTxQueueStart;	/* 0x8, official name */
	UINT32		ui32ACXRxQueueStart;	/* 0xc */
	UINT8		*pTxBufferPool;		/* 0x10 */
	dma_addr_t	TxBufferPoolPhyAddr;	/* 0x14 */
	UINT32		TxBufferPoolSize;	/* 0x18 */
	struct	txdescriptor	*pTxDescQPool;	/* V13POS 0x1c, official name */
	UINT32		tx_pool_count;		/* 0x20 indicates # of ring buffer pool entries */
	UINT32		tx_head;		/* 0x24 current ring buffer pool member index */
	UINT32		tx_tail;		/* 0x34,pool_idx2 is not correct, I'm
						 * just using it as a ring watch
						 * official name */
	struct	framehdr	*pFrameHdrQPool;/* 0x28 */
	UINT32		FrameHdrQPoolSize;	/* 0x2c */
	dma_addr_t	FrameHdrQPoolPhyAddr;	/* 0x30 */
	UINT32 		val0x38;		/* 0x38, NOT USED */

	struct txhostdescriptor *pTxHostDescQPool;	/* V3POS 0x3c, V1POS 0x60 */
	UINT		TxHostDescQPoolSize;	/* 0x40 */
	UINT32		TxHostDescQPoolPhyAddr;	/* 0x44 */
	UINT32		val0x48;		/* 0x48, NOT USED */
	UINT32		val0x4c;		/* 0x4c, NOT USED */

	struct	rxdescriptor	*pRxDescQPool;	/* V1POS 0x74, V3POS 0x50 */
	UINT32		rx_pool_count;		/* V1POS 0x78, V3POS 0X54 */
	UINT32		rx_tail;		/* 0x6c */
	UINT32		val0x50;		/* V1POS:0x50, some size NOT USED */
	UINT32		val0x54;		/* 0x54, official name NOT USED */

	struct rxhostdescriptor *pRxHostDescQPool;	/* 0x58, is it really rxdescriptor? */
	UINT32		RxHostDescQPoolSize;	/* 0x5c */
	UINT32		RxHostDescQPoolPhyAddr;	/* 0x60, official name. */
	UINT32		val0x64;		/* 0x64, some size */
	UINT32		*pRxBufferPool;		/* *rxdescq1; 0x70 */
	UINT32		RxBufferPoolPhyAddr;	/* *rxdescq2; 0x74 */
	UINT32		RxBufferPoolSize;
} TIWLAN_DC;

/*--- 802.11 Management capabilities -----------------------------------------*/
#define IEEE802_11_MGMT_CAP_ESS		(1 << 0)
#define IEEE802_11_MGMT_CAP_IBSS	(1 << 1)
#define IEEE802_11_MGMT_CAP_CFP_ABLE	(1 << 2)
#define IEEE802_11_MGMT_CAP_CFP_REQ	(1 << 3)
#define IEEE802_11_MGMT_CAP_WEP		(1 << 4)
#define IEEE802_11_MGMT_CAP_SHORT_PRE	(1 << 5)
#define IEEE802_11_MGMT_CAP_PBCC	(1 << 6)
#define IEEE802_11_MGMT_CAP_CHAN_AGIL	(1 << 7)

/*--- 802.11 Basic Service Set info ------------------------------------------*/
typedef struct bss_info {
	UINT8 bssid[ETH_ALEN];	/* BSSID (network ID of the device) */
	UINT8 mac_addr[ETH_ALEN];	/* MAC address of the station's device */
	UINT8 essid[IW_ESSID_MAX_SIZE + 1];	/* ESSID and trailing '\0'  */
	size_t essid_len;	/* Length of ESSID (FIXME: \0 included?) */
	UINT16 caps;		/* 802.11 capabilities information */
	UINT8 channel;		/* 802.11 channel */
	UINT16 wep;	/* WEP flag (FIXME: redundant, bit 4 in caps) */
	unsigned char supp_rates[64]; /* FIXME: 802.11b section 7.3.2.2 allows 8 rates, but 802.11g devices seem to allow for many more: how many exactly? */
	UINT32 sir;		/* 0x78; Standard IR */
	UINT32 snr;		/* 0x7c; Signal to Noise Ratio */
	UINT16 beacon_interval;	/* 802.11 beacon interval */
} bss_info_t;				/* 132 0x84 */

/*============================================================================*
 * Main acx100 per-device data structure (netdev->priv)                       *
 *============================================================================*/

#define ACX_STATE_FW_LOADED	0x01
#define ACX_STATE_IFACE_UP	0x02

/* MAC mode (BSS type) defines for ACX100.
 * Note that they shouldn't be redefined, since they are also used
 * during communication with firmware */
#define ACX_MODE_0_IBSS_ADHOC	0
#define ACX_MODE_1_UNUSED	1
#define ACX_MODE_2_MANAGED_STA	2
#define ACX_MODE_3_MANAGED_AP	3
#define ACX_MODE_FF_AUTO	0xff	/* pseudo mode - not ACX100 related! (accept both Ad-Hoc and Managed stations for association) */



/* FIXME: this should be named something like struct acx100_priv (typedef'd to
 * acx100_priv_t) */

typedef struct wlandevice {
	/*** Device chain ***/
	struct wlandevice	*next;		/* link for list of devices */

	/*** Linux network device ***/
	struct net_device *netdev;		/* pointer to linux netdevice */
	struct net_device *prev_nd;		/* FIXME: We should not chain via our
						 * private struct wlandevice _and_
						 * the struct net_device. */

	/*** Device statistics ***/
	struct net_device_stats stats;		/* net device statistics */
#ifdef WIRELESS_EXT
	struct iw_statistics wstats;		/* wireless statistics */
#endif
/*	struct p80211_frmrx_t rx; */		/* 802.11 frame rx statistics */

	/*** Power managment ***/
	struct pm_dev *pm;			/* PM crap */

	/*** USB stuff ***/
#if (WLAN_HOSTIF==WLAN_USB)
	struct	usb_device	*usbdev;
	acx100_usbin_t		usbin;
	acx100_usbin_t		bulkin;
	acx100_usbout_t		usbout;
	acx100_usbout_t		bulkout;
	int			usb_txoffset;
	int			usb_txsize;
	int			usb_max_bulkout;
	int			usb_tx_mutex;
	struct txdescriptor *	currentdesc;
	spinlock_t		usb_ctrl_lock;
	spinlock_t		usb_tx_lock;
	struct	urb		*ctrl_urb;
	struct	urb		*bulkrx_urb;
	struct	urb		*bulktx_urb;
	unsigned char	usb_setup[8];
#endif

	/*** Management timer ***/
	struct	timer_list	mgmt_timer;

	/*** Locking ***/
	spinlock_t	lock;			/* mutex for concurrent accesses to structure */

	/*** Hardware identification ***/
	UINT8		form_factor;
	UINT8		radio_type;
	UINT8		eeprom_version;

	/*** Firmware identification ***/
	char		firmware_version[20];
	UINT32		firmware_numver;
	UINT32		firmware_id;

	/*** Hardware resources ***/
	UINT16		irq_mask;		/* interrupts types to mask out (not wanted) */

	unsigned long	membase;		/* 10 */
	unsigned long	membase2;		/* 14 */
	void 		*iobase;		/* 18 */
	void		*iobase2;		/* 1c */
	UINT		chip_type;
	char		*chip_name;
	UINT8		bus_type;
	UINT16		*io;

	/*** Device state ***/
	u32		pci_state[16];		/* saved PCI state for suspend/resume */
	int		hw_unavailable;		/* indicates whether the hardware has been
						 * suspended or ejected. actually a counter. */
	UINT16		dev_state_mask;
	int		monitor;		/* whether the device is in monitor mode */
	int		monitor_setting;
	UINT8		led_power;		/* power led status */
	UINT32		get_mask;		/* mask of settings to fetch from the card */
	UINT32		set_mask;		/* mask of settings to write to the card */

	/*** scanning ***/
	UINT16		scan_count;		/* number of times to do channel scan */
	UINT8		scan_mode;		/* 0 == active, 1 == passive, 2 == background */
	UINT16		scan_duration;
	UINT16		scan_probe_delay;
			
	/*** Wireless network settings ***/
